# <div align="center"> Oskar Borkowski <div align="center"> Lab 4

## Łańcuchy znaków i wyrażenia regularne

## Zadania:
1. Znajdź wszystkie nazwy krajów rozpoczynających się na P.
2. Znajdź wszystkie nazwy krajów rozpoczynających się  P i kończących na s.
3. Znajdź wszystkie tytuły filmów, w których znajdują się cyfry.
4. Znajdź wszystkich pracowników z podwójnym imieniem lub nazwiskiem.
5. Znajdź wszystkie nazwiska aktorów rozpoczynających się od P lub C i mających 5 znaków.
6. Znajdź wszystkie tytuły filmów, w których występują słowa Trip lub Alone.
7. Przeanalizuj zapytania:
	- select first_name from actor where first_name ~ '^ Al\[a: z, 1: 9\] *'
	- select first_name from actor where first_name ~ * '^ al\[a: z, 1: 9\] *'

In [1]:
import pandas as pd
import psycopg2 as pg
c = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020');
pd.set_option("display.max_rows", 20, "display.max_columns", 8)

In [2]:
print("\n1. wszystkie nazwy krajów rozpoczynających się na P")
df = pd.read_sql("SELECT country FROM country \
                  WHERE country LIKE 'P%' ", c)
df

1. wszystkie nazwy krajów rozpoczynających się na P

/tmp/ipykernel_153949/3365000560.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT country FROM country \

       country
0     Pakistan
1     Paraguay
2         Peru
3  Philippines
4       Poland
5  Puerto Rico

In [3]:
print("\n2. wszystkie nazwy krajów rozpoczynających się P i kończących na s")
df = pd.read_sql("SELECT country FROM country \
                  WHERE country LIKE 'P%s' ", c)
df

2. wszystkie nazwy krajów rozpoczynających się P i kończących na s

/tmp/ipykernel_153949/3262519862.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT country FROM country \

       country
0  Philippines

In [4]:
print("\n3. wszystkie tytuły filmów, w których znajdują się cyfry")
df = pd.read_sql("SELECT title FROM film \
                  WHERE title LIKE '[1:9]' ", c)
df

3. wszystkie tytuły filmów, w których znajdują się cyfry

/tmp/ipykernel_153949/2247202993.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT title FROM film \

Empty DataFrame
Columns: [title]
Index: []

In [5]:
print("\n4. wszystkich pracowników z podwójnym imieniem lub nazwiskiem")
df = pd.read_sql("SELECT first_name, last_name FROM staff \
                  WHERE first_name ~ ' ' OR  last_name ~ ' '", c)
df

/tmp/ipykernel_153949/2715693709.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT first_name, last_name FROM staff \

4. wszystkich pracowników z podwójnym imieniem lub nazwiskiem

Empty DataFrame
Columns: [first_name, last_name]
Index: []

In [6]:
print("\n5. wszystkie nazwiska aktorów rozpoczynających się od P lub C i mających 5 znaków")
df = pd.read_sql("SELECT last_name FROM actor \
                  WHERE (last_name like 'P%' OR last_name like 'C%') \
                  and LENGTH(last_name) = 5 ", c)
df

5. wszystkie nazwiska aktorów rozpoczynających się od P lub C i mających 5 znaków

/tmp/ipykernel_153949/3746800700.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT last_name FROM actor \

  last_name
0     Chase
1     Posey
2     Pesci
3     Crowe
4     Chase
5     Close

In [7]:
print("\n6. wszystkie tytuły filmów, w których występują słowa Trip lub Alone")
df = pd.read_sql("SELECT title FROM film \
                  WHERE title ~ 'Trip' OR title ~ 'Alone'", c)
df

6. wszystkie tytuły filmów, w których występują słowa Trip lub Alone

/tmp/ipykernel_153949/2249363956.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT title FROM film \

           title
0     Alone Trip
1  Superfly Trip
2    Trip Newton
3   Varsity Trip

In [8]:
print("\n7.")
df = pd.read_sql("SELECT first_name FROM actor \
                  WHERE first_name ~ '^Al[a:z,1:9]*'", c)
df

7.

/tmp/ipykernel_153949/529322352.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT first_name FROM actor \

  first_name
0       Alec
1     Albert
2     Albert
3         Al
4       Alan

In [9]:
df = pd.read_sql("SELECT first_name FROM actor \
                  WHERE first_name ~ '^al[a:z,1:9]*'", c)
df

/tmp/ipykernel_153949/2558745228.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT first_name FROM actor \

Empty DataFrame
Columns: [first_name]
Index: []

In [10]:
df = pd.read_sql("SELECT film.title FROM film \
                  WHERE film.title ~* 'airPlane'", c)
df

/tmp/ipykernel_153949/3748493810.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT film.title FROM film \

             title
0  Airplane Sierra
1  Raging Airplane

W pierwszym zapytaniu wielkość liter nie ma znaczenia, a w drugim ma znaczenie

## Zadanie implementacyjne
Zaimplementuj wszystkie funkcje w pliku main.py zgodnie z opisem a następnie przetestuj je w notatniku.

In [11]:
import main
import pandas as pd
import psycopg2 as pg
c = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020');
pd.set_option("display.max_rows", 20, "display.max_columns", 8)

In [12]:
print("\n1.")
main.film_in_category(5)

1.

/media/loren/Documents/AGH/SEM5/AiBD/AiBD_repo/Lab4/main.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df =  pd.read_sql_query("SELECT film.title AS title, language.name AS languge, category.name AS category FROM film \

                  title               languge category
0       Airplane Sierra  English                Comedy
1           Anthem Luke  English                Comedy
2   Bringing Hysterical  English                Comedy
3         Caper Motions  English                Comedy
4         Cat Coneheads  English                Comedy
..                  ...                   ...      ...
53        Valley Packer  English                Comedy
54    Velvet Terminator  English                Comedy
55    Vertigo Northwest  English                Comedy
56        Wisdom Worker  English                Comedy
57            Zorro Ark  English                Comedy

[58 rows x 3 columns]

In [13]:
main.film_in_category('Comedy')

/media/loren/Documents/AGH/SEM5/AiBD/AiBD_repo/Lab4/main.py:35: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df =  pd.read_sql_query("SELECT film.title AS title, language.name AS languge, category.name AS category FROM film \

                  title               languge category
0       Airplane Sierra  English                Comedy
1           Anthem Luke  English                Comedy
2   Bringing Hysterical  English                Comedy
3         Caper Motions  English                Comedy
4         Cat Coneheads  English                Comedy
..                  ...                   ...      ...
53        Valley Packer  English                Comedy
54    Velvet Terminator  English                Comedy
55    Vertigo Northwest  English                Comedy
56        Wisdom Worker  English                Comedy
57            Zorro Ark  English                Comedy

[58 rows x 3 columns]

In [14]:
main.film_in_category('coMeDy')

/media/loren/Documents/AGH/SEM5/AiBD/AiBD_repo/Lab4/main.py:35: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df =  pd.read_sql_query("SELECT film.title AS title, language.name AS languge, category.name AS category FROM film \

Empty DataFrame
Columns: [title, languge, category]
Index: []

In [15]:
print("\n2.")
main.film_in_category_case_insensitive('Comedy')

2.

/media/loren/Documents/AGH/SEM5/AiBD/AiBD_repo/Lab4/main.py:73: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT film.title, language.name AS languge, category.name AS category FROM film \

                  title               languge category
0       Airplane Sierra  English                Comedy
1           Anthem Luke  English                Comedy
2   Bringing Hysterical  English                Comedy
3         Caper Motions  English                Comedy
4         Cat Coneheads  English                Comedy
..                  ...                   ...      ...
53        Valley Packer  English                Comedy
54    Velvet Terminator  English                Comedy
55    Vertigo Northwest  English                Comedy
56        Wisdom Worker  English                Comedy
57            Zorro Ark  English                Comedy

[58 rows x 3 columns]

In [16]:
main.film_in_category_case_insensitive('coMeDy')

/media/loren/Documents/AGH/SEM5/AiBD/AiBD_repo/Lab4/main.py:73: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT film.title, language.name AS languge, category.name AS category FROM film \

                  title               languge category
0       Airplane Sierra  English                Comedy
1           Anthem Luke  English                Comedy
2   Bringing Hysterical  English                Comedy
3         Caper Motions  English                Comedy
4         Cat Coneheads  English                Comedy
..                  ...                   ...      ...
53        Valley Packer  English                Comedy
54    Velvet Terminator  English                Comedy
55    Vertigo Northwest  English                Comedy
56        Wisdom Worker  English                Comedy
57            Zorro Ark  English                Comedy

[58 rows x 3 columns]

In [17]:
print("\n3.")
main.film_cast('Raging Airplane')

/media/loren/Documents/AGH/SEM5/AiBD/AiBD_repo/Lab4/main.py:97: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT first_name, last_name FROM actor \

3.

  first_name  last_name
0        Bob    Fawcett
1       John     Suvari
2     Minnie  Zellweger

In [18]:
main.film_cast('raging airplane')

/media/loren/Documents/AGH/SEM5/AiBD/AiBD_repo/Lab4/main.py:97: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT first_name, last_name FROM actor \

Empty DataFrame
Columns: [first_name, last_name]
Index: []

In [19]:
print("\n4.")
main.film_title_case_insensitive(['BeD', 'BLOOD', 'SonS', 'son', 'cry'])

4.

/media/loren/Documents/AGH/SEM5/AiBD/AiBD_repo/Lab4/main.py:129: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("select title from film \

             title
0     Bed Highball
1  Blood Argonauts
2     Forrest Sons
3   Sons Interview
4    Submarine Bed